<?php
	
    //校检手机号码
    function ExCheck($tel='')
    {
        //长度不满11
        if(strlen($tel) == "11") 
        { 
        //上面部分判断长度是不是11位 
        $n = preg_match_all("/1[123456789]{1}\d{9}$/",$tel,$array); 
        /*接下来的正则表达式("/131,132,133,135,136,139开头随后跟着任意的8为数字 '|'(或者的意思) 
        * 151,152,153,156,158.159开头的跟着任意的8为数字 
        * 或者是188开头的再跟着任意的8为数字,匹配其中的任意一组就通过了 
        * /")*/ 
            $arr=array("error"=>"0","msg"=>$array[0][0]);
        
        //var_dump($array); //看看是不是找到了,如果找到了,就会输出电话号码的 
        }else 
        { 
            $arr=array("error"=>"1","msg"=>"请输入11位手机号";
           
        } 
        
        return $arr;
    }
    
  //  $aaa=ExCheck("13422222222");
//    print_r($aaa);
?>